using System;

namespace lab4
{
    class Program
    {
        /*Визначити клас Дроби – раціональні числа, які є відношенням двох цілих чисел.
        Поля:
        • чисельник,
        • знаменник.
        Напишіть методи для:
        • введення та
        • виведення дробу (чисельника та знаменника),
        • скорочення та
        • обчислення значення дробу*/
        static void Main(string[] args)
        {
            Fraction f = new Fraction();
            f.Read();
            f.Display();
        }
    }
}
